Show / Hide Table of Contents
Class ArcSegment2D
Represents an arc segment in two-dimensional space.
Inheritance
System.Object
OpenObject
Segment2D
ArcSegment2D
Inherited Members
 Segment2D.EndPoint
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry2D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry2D.CircularArcSegment2D,CI.Geometry2D")]
public class ArcSegment2D : Segment2D
Properties
Improve this Doc   View Source
Point
Gets or sets the point of circular arc somewhere between start and end point.
Declaration
public Point2D Point { get; set; }
Property Value
 Type |  Description
 Point2D
 Improve this Doc
 View Source